espressif/esp-idf/tools/test_apps/system/panic/sdkconfig.ci.coredump_flash_elf_sha
CONFIG_IDF_TARGET="esp32"
CONFIG_ESP32_ENABLE_COREDUMP_TO_FLASH=y
CONFIG_ESP32_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP32_COREDUMP_CHECKSUM_SHA256=y
